[
  {
    "job_id": "linkedin_1",
    "source": "linkedin",
    "job_title": "Analytics Engineer (L4) - Commerce Core",
    "company_name": "Netflix",
    "location": "Los Gatos, CA",
    "application_link": "https://www.linkedin.com/jobs/view/analytics-engineer-l4-commerce-core-at-netflix-4314930088?position=1&pageNum=0&refId=KHVHPjqHP0wpBlthSsEOEQ%3D%3D&trackingId=v8hHoDr%2B5QkaPTRssSk4PQ%3D%3D",
    "posted_date": "2025-11-11",
    "scraped_at": "2025-11-15T03:47:05.688690Z",
    "status": "new",
    "job_description": "Netflix is one of the world's leading entertainment services, with over 300 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.\n\nAs Netflix's business grows, it becomes increasingly important to support a wide set of business stakeholders with the right data, metrics, and analytic tools. Our Commerce Core team within Finance Data Science and Engineering ensures we accurately measure Netflix’s business success, enabling our partners to access key metrics and leverage data efficiently to deepen their understanding of the business and optimize our business around the globe.\n\nWe are searching for an Analytics Engineer who is passionate about building scalable analytics solutions, developing metrics that drive executive decision-making, and experimenting with modern technologies. You will collaborate with cross-functional partners including Data Engineering, Finance, Product, and Engineering teams, to develop insights and tools that support critical business decisions and operational excellence at Netflix.\n\nIn This Role, You Will\n\n\nPartner with Data Engineers to design and implement robust data models and pipelines that enable richer, faster, and more accurate analysis.\nDesign, build, and maintain scalable, self-service analytics tools and data products to drive adoption across the business.\nDevelop, define, and maintain key metrics and dashboards for executive and business-critical reporting.\nProactively identify gaps and opportunities for innovation in analytics engineering, and drive initiatives to address them.\nExperiment with and evaluate new technologies, including Generative AI solutions, to improve analytics, reporting, and data accessibility.\nTranslate complex data insights and technical concepts into clear, actionable recommendations for technical and non-technical stakeholders.\n\n\nWe’d love to hear from you if you have:\n\n\nA degree in a quantitative field (e.g., mathematics, statistics, computer science, engineering, or similar), and 3+ years of experience in data engineering, data science, analytics engineering, or a similar data field.\nProficient in PySpark or Scala Spark, with experience building and scaling data models, pipelines, and analytics tools.\nAdvanced SQL skills, with experience working in complex data environments.\nExperience with scripting languages, particularly Python.\nFamiliarity with modern data technologies such as Trino, Spark, and Snowflake.\nUnderstanding of data governance, data lineage, and cataloging, and their importance for data quality and automation.\nExperience with data visualization platforms (e.g., Tableau, Looker, Plotly) and a strong ability to communicate data-driven stories.\nFamiliarity with Generative AI/ML concepts and a passion for experimenting with new technologies.\nExcellent verbal and written communication skills, with the ability to articulate metric definitions, data insights, and project roadmaps to diverse audiences.\nYou relate to and embody many aspects of Netflix's Culture. You love working independently, are comfortable with ambiguity, and have a passion for continuous learning.\nExperience in e-commerce or subscription-oriented businesses is a plus.\n\n\nOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000.\n\nNetflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.\n\nNetflix has a unique culture and environment. Learn more here.\n\nInclusion is a Netflix value and we strive to host a meaningful interview experience for all candidates. If you want an accommodation/adjustment for a disability or any other reason during the hiring process, please send a request to your recruiting partner.\n\nWe are an equal-opportunity employer and celebrate diversity, recognizing that diversity builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.\nShow more",
    "work_mode": "onsite",
    "skills": [
      "looker",
      "pyspark",
      "python",
      "spark",
      "sql",
      "tableau"
    ],
    "match_score": 0.55,
    "visa_sponsorship": null
  }
]